In [1]:
from pymongo import MongoClient

In [2]:
client = MongoClient("mongodb://localhost:27017") # our client instance gives us access to all the databases created at said server url

In [3]:
database = client.mydb 
collection = database['products']

In [5]:
found_data = collection.find_one({"title": "iPhone 14 Pro"})
found_data

{'_id': ObjectId('63a895d2a829e1fee1eb3c70'),
 'title': 'iPhone 14 Pro',
 'price': Decimal128('1000.00'),
 'stock_quantity': 18}

In [13]:
for doc in collection.find():
    print(doc)

{'_id': ObjectId('63a895d2a829e1fee1eb3c70'), 'title': 'iPhone 14 Pro', 'price': Decimal128('1000.00'), 'stock_quantity': 18, 'brand': 'apple'}

In [9]:
collection.count_documents({'brand': 'apple'})

1

In [11]:
collection.count_documents({})

2

In [12]:
collection.delete_one({"brand": "samsung"})

In [14]:
import pandas as pd
import sqlite3

In [15]:
conn = sqlite3.connect("test.db")

In [16]:
df = pd.read_sql_query(sql="SELECT * FROM employees", con=conn)
df

   id   name  age       job
0   2  alice   25  engineer
1   3    tom   21  engineer

In [17]:
df.to_csv("export.csv", index=False)

### Challenge
* Completely modify it to work with mongodb from what we have learned 
* after that make a small pipeline where you :
1. grab data from an api 
2. push that data into mongodb 
3. read the data from mongodb and pack it into a dataframe
4. make that dataframe export to a csv

In [18]:
pd.DataFrame([
    {
        "name": "joe",
        "age": 32
    },
    {
        "name": "alice",
        "age": 23
    }
])

    name  age
0    joe   32
1  alice   23